# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

fusion_mode: bifpn
C2f: C2f
head_channel: 128

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] 
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  

  - [-4, 1, Conv, [64, 3, 2]] # 10-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 11-P2/4
  - [-1, 3, C2f, [128, True]] #12
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 15-P4/16
  - [-1, 6, C2f, [512, True]] 
  - [-1, 1, Conv, [1024, 3, 2]] # 17-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 19

  - [[2,12], 1, Concat, [1]] # 20 
  - [[4,14], 1, Concat, [1]] # 21
  - [[6,16], 1, Concat, [1]] # 22
  - [[9,19],1, Concat, [1]] # 23
# YOLOv8.0n head
head:

  - [21, 1, Conv, [128]]  # 24
  - [22, 1, Conv, [128]]  # 25
  - [23, 1, Conv, [128]]  # 26
 
  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']] #27
  - [[-1, 25], 1, Concat, [1]] #28
  - [-1, 3, C2f, [128]] # 29
 
  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']] #30
  - [[-1, 24], 1, Concat, [1]] #31
  - [-1, 3, C2f, [128]] #32
  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']] #33
 
  - [20, 1,  Conv, [128]]  #34
  - [[-1, 33], 1, Concat, [1]] #35
  - [-1, 3, C2f, [128]] #36
 
  - [-1, 1, Conv, [128, 3, 2]] #37
  - [[-1, 24, 32], 1, Concat, [1]] #38 
  - [-1, 3, C2f, [128]] # 39
 
  - [-1, 1, Conv, [128, 3, 2]] #40
  - [[-1, 25, 29], 1, Concat, [1]] #41 
  - [-1, 3, C2f, [128]] # 42
 
  - [-1, 1, Conv, [128, 3, 2]] #43
  - [[-1, 26], 1, Concat, [1]] #44
  - [-1, 3, C2f, [128]] # 45
 
  - [[36, 39, 42,45], 1, Detect, [nc]] #46


 