# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 7 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 1, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 1, C2f, [256, True]] # 4
  - [-1, 1, C2f, [256, True]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6
  - [-1, 1, C2f, [512, True]] # 7
  - [-1, 1, C2f, [512, True]] # 8
  - [-1, 1, Conv, [1024, 3, 2]] # 9
  - [-1, 1, C2f, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11
  


  - [-4, 1, Conv, [64, 3, 2]]  # 12 
  - [-1, 1, Conv, [128, 3, 2]]  # 13
  - [-1, 1, C2f, [128, True]] #14
  - [-1, 1, Conv, [256, 3, 2]]  # 15
  - [-1, 1, C2f, [256, True]] #16
  - [-1, 1, FEM, [256,3]] #17
  - [-1, 1, Conv, [512, 3, 2]]  # 18
  - [-1, 1, C2f, [512, True]] #19
  - [-1, 1, FEM, [512,3]] #20
  - [-1, 1, Conv, [1024, 3, 2]]  # 21
  - [-1, 1, C2f, [1024, True]] #22
  - [-1, 1, FEM, [1024,3]] #23
  - [-1, 1, SPPF, [1024, 5]]  # 24

  - [[4,17], 1, CSFM, [1]] # 25
  - [[6,20], 1, CSFM, [1]] # 26
  - [[9,24],1, CSFM, [1]] # 27
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #28
  - [[-1, 26], 1, Concat, [1]] # 29
  - [-1, 3, C2f, [512]] # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #31
  - [[-1, 25], 1, Concat, [1]] #  32
  - [-1, 3, C2f, [256]] #  33

  - [-1, 1, Conv, [256, 3, 2]] #34
  - [[-1, 30], 1, Concat, [1]] # 35
  - [-1, 3, C2f, [512]] # 36

  - [-1, 1, Conv, [512, 3, 2]] # 37
  - [[-1, 27], 1, Concat, [1]] # 38
  - [-1, 3, C2f, [1024]] # 39

  - [[33, 36, 39], 1, Detect, [nc]] # Detect(P3, P4, P5)
